frontend/views/solicitacao/view.php

            ]) ?>

    <?php
    $departamento = Usuario::findOne(Yii::$app->getUser()->id)->id_departamento;
---
SELECT * FROM `user` WHERE `id`=4