frontend/views/veiculo/_form.php

SELECT * FROM `modelo`
---

            <?= $form->field($model, 'id_modelo')->dropDownList(ArrayHelper::map(Modelo::find()->all(), 'id', 'nome'), ['prompt'=>'Selecione uma opção']) ?>

            <?= $form->field($model, 'id_cor')->dropDownList(ArrayHelper::map(Cor::find()->all(), 'id', 'nome'), ['prompt'=>'Selecione uma opção']) ?>