frontend/controllers/ManutencaoController.php

SELECT * FROM `user` WHERE `id`=7
---
    public function behaviors()
    {
        return [
            'access' => [
                'class' => AccessControl::className(),
                'only' => ['create','index','update','view','delete'],
                'rules' => [
                    array(
                        'allow' => true,
                        'actions' => ['create','index','update','view','delete'],
                        'matchCallback' => function($rule,$action) {
                            if (!Yii::$app->user->isGuest) {
                                return Usuario::findOne(Yii::$app->getUser()->id)->id_departamento == "1";

SELECT * FROM `manutencao` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Manutencao::findOne($id)) !== null) {