frontend/controllers/SolicitacaoController.php

    protected function findModel($id)
    {
        if (($model = Solicitacao::findOne($id)) !== null) {
---
SELECT * FROM `solicitacao` WHERE `id`='6'