frontend/views/layouts/header.php

SELECT * FROM `user` WHERE `id`=7
---
                  function geraTimestamp($data) {
                      $partes = explode('/', $data);
                      return mktime(0, 0, 0, $partes[1], $partes[0], $partes[2]);
                  }

                  if (Usuario::findOne(Yii::$app->getUser()->id)->id_departamento == "1") {

SELECT * FROM `departamento` WHERE `id`=1
SELECT * FROM `user` WHERE `id`=4
---
                        $count++;
                    endforeach;

                    if(Usuario::findOne(Yii::$app->getUser()->id)->id_departamento == "1") {