frontend/views/layouts/leftmenu.php

                    if(Yii::$app->user->isGuest){
                        echo "Visitante";
                    }else{
                        echo $departamento = Departamento::findOne($departamento)->nome;
---
SELECT * FROM `departamento` WHERE `id`=1


              <li class="treeview">
                  <?php
                  if (Usuario::findOne(Yii::$app->getUser()->id)->id_departamento == "1") {
---
SELECT * FROM `user` WHERE `id`=7


                      <li>
                          <?php
                          if (Usuario::findOne(Yii::$app->getUser()->id)->id_departamento == "1")
---
SELECT * FROM `user` WHERE `id`=7


                      <li>
                          <?php
                          if (Usuario::findOne(Yii::$app->getUser()->id)->id_departamento == "1")
---
SELECT * FROM `user` WHERE `id`=7


              <li class="treeview">
                  <?php
                  if (Usuario::findOne(Yii::$app->getUser()->id)->id_departamento == "1") {
---
SELECT * FROM `user` WHERE `id`=4


                      <li>
                          <?php
                          if (Usuario::findOne(Yii::$app->getUser()->id)->id_departamento == "1")
---
SELECT * FROM `user` WHERE `id`=7

                      </li>
                      <li>
                          <?php
                          if (Usuario::findOne(Yii::$app->getUser()->id)->id_departamento == "1")
---
SELECT * FROM `user` WHERE `id`=7

                      </li>
                      <li>
                          <?php
                          if (Usuario::findOne(Yii::$app->getUser()->id)->id_departamento == "1")
---
SELECT * FROM `user` WHERE `id`=7

                      </li>
                      <li>
                          <?php
                          if (Usuario::findOne(Yii::$app->getUser()->id)->id_departamento == "1")
---
SELECT * FROM `user` WHERE `id`=7

                      </li>
                      <li>
                          <?php
                          if (Usuario::findOne(Yii::$app->getUser()->id)->id_departamento == "1")
---
SELECT * FROM `user` WHERE `id`=7


              <li>
                  <?php
                  if (Usuario::findOne(Yii::$app->getUser()->id)->id_departamento == "1") {
---
SELECT * FROM `user` WHERE `id`=7


              <li>
                  <?php
                  if (Usuario::findOne(Yii::$app->getUser()->id)->id_departamento == "1") {
---
SELECT * FROM `user` WHERE `id`=7


              <li>
                  <?php
                  if (Usuario::findOne(Yii::$app->getUser()->id)->id_departamento == "1") {
---
SELECT * FROM `user` WHERE `id`=4


              <li>
                  <?php
                  if (Usuario::findOne(Yii::$app->getUser()->id)->id_departamento == "1") {
---
SELECT * FROM `user` WHERE `id`=7


              <li>
                  <?php
                  if (Usuario::findOne(Yii::$app->getUser()->id)->id_departamento == "1") {
---
SELECT * FROM `user` WHERE `id`=7