frontend/views/manutencao/_form_update.php

SELECT * FROM `veiculo`
---
                    ]
                ]);?>

            <?= $form->field($model, 'id_veiculo')->dropDownList(ArrayHelper::map(Veiculo::find()->all(), 'renavam', 'placa_atual'), ['prompt'=>'Selecione a placa do veículo']) ?>

SELECT * FROM `motorista`
---
                ->hint('Insira um número inteiro.')
            ?>

            <?= $form->field($model, 'id_motorista')->dropDownList(ArrayHelper::map(Motorista::find()->all(), 'cnh', 'nome'), ['prompt'=>'Selecione o nome do motorista']) ?>