frontend/models/Modelo.php

SELECT * FROM `marca` WHERE `id`=4
---
    public  function afterFind(){
        $this->id_marca = Marca::findOne($this->id_marca)->nome;