frontend/models/Veiculo.php

SELECT * FROM `cor` WHERE `id`=6
SELECT * FROM `tipo_combustivel` WHERE `id`=3
SELECT * FROM `modelo` WHERE `id`=5
---
    public  function afterFind(){
        $this->id_cor = Cor::findOne($this->id_cor)->nome;
        $this->id_tipo_combustivel = TipoCombustivel::findOne($this->id_tipo_combustivel)->nome;
        $this->id_modelo = Modelo::findOne($this->id_modelo)->nome;